In [16]:
import pandas as pd
import sqlite3

In [4]:
df = pd.read_csv('book.csv',sep = ';')

In [5]:
df

                      num              dates
0       998 997 000 000     03.11.2022 17:57
1       998 936 000 000     03.11.2022 17:57
2       998 937 000 000     03.11.2022 17:57
3       998 994 000 000     03.11.2022 17:57
4       998 991 000 000     03.11.2022 17:57
...                    ...               ...
44843   998 935 000 000     27.10.2022 14:59
44844   998 995 000 000      23.10.2022 7:09
44845   998 909 000 000     16.10.2022 18:46
44846   998 911 000 000     05.10.2022 20:35
44847   998 915 000 000      19.10.2022 2:25

[44848 rows x 2 columns]

In [6]:
df['dates'] = pd.to_datetime(df['dates'],format = '%d.%m.%Y %H:%M')

In [7]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 44848 entries, 0 to 44847
Data columns (total 2 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0    num    44848 non-null  object
 1   dates   44848 non-null  datetime64[ns]
dtypes: datetime64[ns](1), object(1)
memory usage: 700.9+ KB

In [8]:
pf=df.groupby('dates').count().reset_index()

In [9]:
pf.sort_values(by = 'dates',ascending=False)

                    dates   num
20261 2022-11-03 17:58:00      3
20260 2022-11-03 17:57:00     52
20259 2022-11-03 17:56:00     46
20258 2022-11-03 17:55:00     56
20257 2022-11-03 17:54:00     38
...                   ...    ...
4     2022-10-03 01:00:00      1
3     2022-10-03 00:59:00      2
2     2022-10-03 00:33:00      1
1     2022-10-03 00:14:00      1
0     2022-10-03 00:11:00      1

[20262 rows x 2 columns]

In [10]:
df.isna().mean()

 num     0.0
dates    0.0
dtype: float64

In [11]:
df.columns

Index([' num ', 'dates'], dtype='object')

In [12]:
df.columns = ['num', 'dates']

In [13]:
df['num'] = df['num'].str.replace(' ','')

In [14]:
df['num'] = df['num'].astype("int64")

In [15]:
df.groupby('num')[['dates']].agg({'dates':'count'}).reset_index().sort_values(by='dates',ascending=False)

              num  dates
123  998997000000   1063
122  998996000000   1060
117  998991000000   1053
120  998994000000   1043
121  998995000000    989
..            ...    ...
18   998581000000      1
111  998985000000      1
19   998709000000      1
20   998719000000      1
0    998099000000      1

[127 rows x 2 columns]

In [17]:
con = sqlite3.connect('db')

In [18]:
df.to_sql('data',con,index=False,if_exists='replace')

44848

In [28]:
sql = '''select * from data t 
where num = 998997000000
limit 1'''

In [29]:
pd.read_sql(sql,con)

            num                dates
0  998997000000  2022-11-03 17:57:00

In [32]:
def select(sql):
    return pd.read_sql(sql,con)

In [33]:
select(sql)

            num                dates
0  998997000000  2022-11-03 17:57:00

In [34]:
sql = '''select * from data'''

In [36]:
select(sql)

                num                dates
0      998997000000  2022-11-03 17:57:00
1      998936000000  2022-11-03 17:57:00
2      998937000000  2022-11-03 17:57:00
3      998994000000  2022-11-03 17:57:00
4      998991000000  2022-11-03 17:57:00
...             ...                  ...
44843  998935000000  2022-10-27 14:59:00
44844  998995000000  2022-10-23 07:09:00
44845  998909000000  2022-10-16 18:46:00
44846  998911000000  2022-10-05 20:35:00
44847  998915000000  2022-10-19 02:25:00

[44848 rows x 2 columns]

In [39]:
df['dates'].describe()

C:\Users\dmitriy.kalganov\AppData\Local\Temp\ipykernel_10108\2712964336.py:1: FutureWarning: Treating datetime data as categorical rather than numeric in `.describe` is deprecated and will be removed in a future version of pandas. Specify `datetime_is_numeric=True` to silence this warning and adopt the future behavior now.
  df['dates'].describe()

count                   44848
unique                  20262
top       2022-11-03 17:55:00
freq                       56
first     2022-10-03 00:11:00
last      2022-11-03 17:58:00
Name: dates, dtype: object